#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотУзел = Объект.ЭтотУзел;
	Элементы.ГруппаПодключение.Видимость = Не ЭтотУзел;	
	Элементы.АктивнаяИнтеграция.Видимость = ЭтотУзел;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПроверитьПодключение(Команда)
	
	Если НеобходимоЗаписатьОбъект() Тогда
		Возврат;
	КонецЕсли;
	
	КомандаПроверитьПодключениеНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеРеквизитовФормы

//

#КонецОбласти

#Область Прочее

&НаСервере
Процедура КомандаПроверитьПодключениеНаСервере()
	
	_ОбменUPP.Пинг_Запрос(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Функция НеобходимоЗаписатьОбъект()
	
	НеобходимоЗаписать = Ложь;
	
	Если Модифицированность Или Объект.Ссылка.Пустая() Тогда 
		
		ТекстСообщения = Нстр("ru='Необходимо записать объект.'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,НеобходимоЗаписать);
		
	КонецЕсли;
	
	Возврат НеобходимоЗаписать;
	
КонецФункции

#КонецОбласти

#КонецОбласти
