#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ЭтотУзел Тогда 
		
		ПроверяемыеРеквизиты.Очистить();
		ПроверяемыеРеквизиты.Добавить("Код");
		ПроверяемыеРеквизиты.Добавить("Наименование");
		
		Если АктивнаяИнтеграция Тогда 
			
			Узел = Метаданные.Константы._УзелОбменаUPP.Имя;
			
			Если Не ЗначениеЗаполнено(Узел) Тогда 
				
				ТекстСообщения = Нстр("ru='Для активной интеграции необходимо установить узел по умолчанию'");
				
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли